'''Создать строку равную предпоследнему символу
введенной строки.'''

input_str = input('Please enter enytning: ')
new_srt = input_str[-2]

print('Your new string is: ' + str(new_srt))
