'''Создать строку равную первым пяти символам
введенной строки.'''

input_str = input('Please enter enything: ')
new_str = input_str[:5]

print('Your new string looks as follows: ' + str(new_str))
