'''Создать строку равную третьему символу введенной
строки.'''

input_str = input('Please enter anything: ')
create_new_str_3_item = input_str[2]

print('Your new string is 3rd character: ' + str(create_new_str_3_item))
