#  Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

a = 7
b = 9

summa = a + b
difference = b - a
multipl = a * b

print("a = 7")
print("b = 9")
print("\nSumm: " + str(summa))
print("Difference: " + str(difference))
print("Multiplication: " + str(multipl))
