"""Даны два действительных числа. Найти среднее
арифметическое и среднее геометрическое этих
чисел."""


x = 6
y = 7

solution_1  = (x + y) / 2
solution_2 = pow(x * y, (1 / 2))

print("X: " + str(x))
print("Y: " + str(y) + "\n")

print("Solution_1: " + str(solution_1))
print("Solution_2: " + str(solution_2))
