"""Дана длина ребра куба. Найти объем куба и
площадь его боковой поверхности."""

l = 12

v = pow(l, 3)
s = l ** 2

print("Cube edge length: " + str(l))
print("\nV: " + str(v))
print("S: " + str(s))
